### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
HeroesOfPymoli = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
HoP_df = pd.read_csv(HeroesOfPymoli)
HoP_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [2]:
Player_Count = HoP_df["SN"].nunique()
Player_Count

576

In [3]:
data = {'Total Players':[Player_Count]}
PC_df = pd.DataFrame(data)
PC_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
# Number of Unique Items
U_Items_Count = HoP_df["Item ID"].nunique()
U_Items_Count

183

In [5]:
#Average Price
Average_Price = HoP_df["Price"].mean()
Average_Price

3.050987179487176

In [6]:
#Total Number of Purchases
Number_P = HoP_df["Purchase ID"].count()
Number_P

780

In [7]:
#Total Revenue
T_Revenue= Number_P * Average_Price
T_Revenue

2379.7699999999973

In [8]:
PAdata = {'Number of Unique Items':[U_Items_Count], 'Average Price':[Average_Price], 'Number of Purchases' :[Number_P], 'Total Revenue' :[T_Revenue]}
PA_df = pd.DataFrame(PAdata)
PA_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [9]:
#Count of Players
G_Players_df = HoP_df.loc[1:, ["SN","Gender","Price","Purchase ID"]]
GP=G_Players_df.drop_duplicates()
GP

                SN  Gender  Price  Purchase ID
1      Lisovynya38    Male   1.56            1
2       Ithergue48    Male   4.88            2
3    Chamassasya86    Male   3.27            3
4        Iskosia90    Male   1.44            4
5          Yalae81    Male   3.61            5
..             ...     ...    ...          ...
775     Aethedru70  Female   3.54          775
776         Iral74    Male   1.63          776
777     Yathecal72    Male   3.46          777
778        Sisur91    Male   4.19          778
779      Ennrian78    Male   4.60          779

[779 rows x 4 columns]

In [10]:
Gender_Count=GP['Gender'].value_counts()
Gender_Count

Male                     651
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [11]:
Percent_of_Players= (Gender_Count / Player_Count)*100
Percent_of_Players

Male                     113.020833
Female                    19.618056
Other / Non-Disclosed      2.604167
Name: Gender, dtype: float64

In [12]:
GAdata = {'Total Count':[Gender_Count], 'Percentage of Players':[Percent_of_Players]}
GA_df = pd.DataFrame(GAdata)
GA_df

,Total Count,Percentage of Players
0,Male 651 Female ...,Male 113.020833 Female ...


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [13]:
# Purchase analysis
Purchase_Analysis_df = HoP_df.loc[ 1:,["Gender","Price",]]
Purchase_Analysis_df

     Gender  Price
1      Male   1.56
2      Male   4.88
3      Male   3.27
4      Male   1.44
5      Male   3.61
..      ...    ...
775  Female   3.54
776    Male   1.63
777    Male   3.46
778    Male   4.19
779    Male   4.60

[779 rows x 2 columns]

In [14]:
PA_Count = Purchase_Analysis_df['Gender'].value_counts()
PA_Count

Male                     651
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [15]:
#AVG purchase price per member
Avg_Purchase_Price = HoP_df.loc[ 1:,["Price"]]
Avg_Purchase_Price.mean()

Price    3.050372
dtype: float64

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [16]:
Age_df = HoP_df.loc[1:, ["SN","Age"]]
AG=Age_df.drop_duplicates()
AgeD=pd.DataFrame(AG)
AgeD

                SN  Age
1      Lisovynya38   40
2       Ithergue48   24
3    Chamassasya86   24
4        Iskosia90   23
5          Yalae81   22
..             ...  ...
773         Hala31   21
774     Jiskjask80   11
775     Aethedru70   21
777     Yathecal72   20
778        Sisur91    7

[576 rows x 2 columns]

In [17]:
#Establish Bins
bins= [0,10,15,20,25,30,35,40,100]

group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

AgeD["age ranges"] = pd.cut(AgeD["Age"], bins, labels=group_names)

AgeD.head()

              SN  Age age ranges
1    Lisovynya38   40      35-39
2     Ithergue48   24      20-24
3  Chamassasya86   24      20-24
4      Iskosia90   23      20-24
5        Yalae81   22      20-24

In [18]:
#Total Counts
Total_Count = AgeD['age ranges'].value_counts()
Total_Count

20-24    232
15-19    150
25-29     59
10-14     41
30-34     37
35-39     26
<10       24
40+        7
Name: age ranges, dtype: int64

In [19]:
#Percentage of Players
Percent_of_GPlayers= (Total_Count / Player_Count)*100
Percent_of_GPlayers

20-24    40.277778
15-19    26.041667
25-29    10.243056
10-14     7.118056
30-34     6.423611
35-39     4.513889
<10       4.166667
40+       1.215278
Name: age ranges, dtype: float64

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [20]:
PurchaseAnalysis_df = HoP_df.loc[1:, ["SN","Age","Price","Purchase ID"]]
PurchaseAnalysis_df

                SN  Age  Price  Purchase ID
1      Lisovynya38   40   1.56            1
2       Ithergue48   24   4.88            2
3    Chamassasya86   24   3.27            3
4        Iskosia90   23   1.44            4
5          Yalae81   22   3.61            5
..             ...  ...    ...          ...
775     Aethedru70   21   3.54          775
776         Iral74   21   1.63          776
777     Yathecal72   20   3.46          777
778        Sisur91    7   4.19          778
779      Ennrian78   24   4.60          779

[779 rows x 4 columns]

In [21]:
P_Analysis=PurchaseAnalysis_df.drop_duplicates()
PurchaseAS=pd.DataFrame(PurchaseAnalysis_df)
PurchaseAS

                SN  Age  Price  Purchase ID
1      Lisovynya38   40   1.56            1
2       Ithergue48   24   4.88            2
3    Chamassasya86   24   3.27            3
4        Iskosia90   23   1.44            4
5          Yalae81   22   3.61            5
..             ...  ...    ...          ...
775     Aethedru70   21   3.54          775
776         Iral74   21   1.63          776
777     Yathecal72   20   3.46          777
778        Sisur91    7   4.19          778
779      Ennrian78   24   4.60          779

[779 rows x 4 columns]

In [22]:
#Establish Bins
bins= [0,10,15,20,25,30,35,40,100]

group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

PurchaseAS["age ranges"] = pd.cut(PurchaseAS["Age"], bins, labels=group_names)

PurchaseAS

                SN  Age  Price  Purchase ID age ranges
1      Lisovynya38   40   1.56            1      35-39
2       Ithergue48   24   4.88            2      20-24
3    Chamassasya86   24   3.27            3      20-24
4        Iskosia90   23   1.44            4      20-24
5          Yalae81   22   3.61            5      20-24
..             ...  ...    ...          ...        ...
775     Aethedru70   21   3.54          775      20-24
776         Iral74   21   1.63          776      20-24
777     Yathecal72   20   3.46          777      15-19
778        Sisur91    7   4.19          778        <10
779      Ennrian78   24   4.60          779      20-24

[779 rows x 5 columns]

In [23]:
PA_age_Count = PurchaseAS['age ranges'].value_counts()
PA_age_Count

20-24    325
15-19    199
25-29     77
10-14     54
30-34     52
35-39     33
<10       32
40+        7
Name: age ranges, dtype: int64

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [27]:
T_Spenders_df = HoP_df.loc[1:, ["SN","Price"]]
T_Spenders_df

                SN  Price
1      Lisovynya38   1.56
2       Ithergue48   4.88
3    Chamassasya86   3.27
4        Iskosia90   1.44
5          Yalae81   3.61
..             ...    ...
775     Aethedru70   3.54
776         Iral74   1.63
777     Yathecal72   3.46
778        Sisur91   4.19
779      Ennrian78   4.60

[779 rows x 2 columns]

In [37]:
#Cant figure this out
T_Spenders1_df = T_Spenders_df.()
T_Spenders1_df

SN       Lisovynya38Ithergue48Chamassasya86Iskosia90Yal...
Price                                              2376.24
dtype: object

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [38]:
PopItems_df = HoP_df.loc[1:, ["Item Name","Price","Item ID"]]
PopItems_df

                                 Item Name  Price  Item ID
1                        Frenzied Scimitar   1.56      143
2                             Final Critic   4.88       92
3                              Blindscythe   3.27      100
4                                     Fury   1.44      131
5                                Dreamkiss   3.61       81
..                                     ...    ...      ...
775                                   Wolf   3.54       60
776                       Exiled Doomblade   1.63      164
777  Celeste, Incarnation of the Corrupted   3.46       67
778                           Final Critic   4.19      101
779                                   Dawn   4.60       50

[779 rows x 3 columns]

In [39]:
#???
PopItems1_df = PopItems_df.groupby(by="Item Name")
PopItems1_df

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame